results/unused/fabio-4k/002_fio/cmd_273.output
libaio-bdev_aio: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=spdk_bdev, iodepth=4
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666734289,
  "timestamp_ms" : 1666734289535,
  "time" : "Tue Oct 25 23:44:49 2022",
  "jobs" : [
    {
      "jobname" : "libaio-bdev_aio",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "libaio-bdev_aio",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "4",
        "bs" : "4K",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "spdk_bdev",
        "spdk_conf" : "/tmp/spdk_bdev_aio_foo.conf",
        "filename" : "Nvme0n1"
      },
      "read" : {
        "io_bytes" : 6368309248,
        "io_kbytes" : 6219052,
        "bw_bytes" : 909628517,
        "bw" : 888309,
        "iops" : 222076.846165,
        "runtime" : 7001,
        "total_ios" : 1554760,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1523,
          "max" : 20198,
          "mean" : 1636.536629,
          "stddev" : 223.818184,
          "N" : 1554760
        },
        "clat_ns" : {
          "min" : 251,
          "max" : 148058,
          "mean" : 16084.288581,
          "stddev" : 5476.140778,
          "N" : 1554763,
          "percentile" : {
            "1.000000" : 13504,
            "5.000000" : 14400,
            "10.000000" : 14528,
            "20.000000" : 14528,
            "30.000000" : 14656,
            "40.000000" : 14656,
            "50.000000" : 14656,
            "60.000000" : 14784,
            "70.000000" : 14784,
            "80.000000" : 14912,
            "90.000000" : 16512,
            "95.000000" : 27008,
            "99.000000" : 36096,
            "99.500000" : 42752,
            "99.900000" : 79360,
            "99.950000" : 90624,
            "99.990000" : 104960
          }
        },
        "lat_ns" : {
          "min" : 9618,
          "max" : 149671,
          "mean" : 17720.825126,
          "stddev" : 5474.918573,
          "N" : 1554763
        },
        "bw_min" : 886712,
        "bw_max" : 890216,
        "bw_agg" : 100.000000,
        "bw_mean" : 888525.785714,
        "bw_dev" : 1043.348321,
        "bw_samples" : 14,
        "iops_min" : 221678,
        "iops_max" : 222554,
        "iops_mean" : 222131.428571,
        "iops_stddev" : 260.832311,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 73.700000,
      "sys_cpu" : 26.285714,
      "ctx" : 4,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.372984,
        "2" : 0.960470,
        "4" : 98.666547,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.010000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.010000,
        "10" : 0.063933,
        "20" : 92.064048,
        "50" : 7.686588,
        "100" : 0.157516,
        "250" : 0.025663,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

libaio-bdev_aio: (groupid=0, jobs=1): err= 0: pid=88319: Tue Oct 25 23:44:49 2022
  read: IOPS=222k, BW=867MiB/s (910MB/s)(6073MiB/7001msec)
    slat (nsec): min=1523, max=20198, avg=1636.54, stdev=223.82
    clat (nsec): min=251, max=148058, avg=16084.29, stdev=5476.14
     lat (usec): min=9, max=149, avg=17.72, stdev= 5.47
    clat percentiles (usec):
     |  1.00th=[   14],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   15], 40.00th=[   15], 50.00th=[   15], 60.00th=[   15],
     | 70.00th=[   15], 80.00th=[   15], 90.00th=[   17], 95.00th=[   28],
     | 99.00th=[   37], 99.50th=[   43], 99.90th=[   80], 99.95th=[   91],
     | 99.99th=[  105]
   bw (  KiB/s): min=886712, max=890216, per=100.00%, avg=888525.79, stdev=1043.35, samples=14
   iops        : min=221678, max=222554, avg=222131.43, stdev=260.83, samples=14
  lat (nsec)   : 500=0.01%
  lat (usec)   : 4=0.01%, 10=0.06%, 20=92.06%, 50=7.69%, 100=0.16%
  lat (usec)   : 250=0.03%
  cpu          : usr=73.70%, sys=26.29%, ctx=4, majf=0, minf=0
  IO depths    : 1=0.4%, 2=1.0%, 4=98.7%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1554760,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=867MiB/s (910MB/s), 867MiB/s-867MiB/s (910MB/s-910MB/s), io=6073MiB (6368MB), run=7001-7001msec